app/controllers/github_apis_controller.rb

  def index
  	# @file_name = []
  	# @path = []
  	@html_url = []
  	@repository = []
  	@key = []
    @user = []
    @user_link = []
  	@keywords = Keyword.all.pluck(:keyword)
    @users = User.all.pluck(:user)
---
SELECT "keywords"."keyword" FROM "keywords"
SELECT "users"."user" FROM "users"