app/controllers/keywords_controller.rb

SELECT "keywords".* FROM "keywords"
---
  def get_data
  		render json: Keyword.all.to_json

INSERT INTO "keywords" ("keyword", "created_at", "updated_at") VALUES (?, ?, ?)  [["keyword", "asdfdf"], ["created_at", "2015-07-29 14:06:00.639570"], ["updated_at", "2015-07-29 14:06:00.639570"]]
SELECT "keywords".* FROM "keywords"
---
  def add
    @key = Keyword.new({:keyword => "#{params[:keyword].strip}"})
    @key.save!
    render json: Keyword.all.to_json

SELECT  "keywords".* FROM "keywords" WHERE "keywords"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "keywords" WHERE "keywords"."id" = ?  [["id", 1]]
SELECT "keywords".* FROM "keywords"
---
  def delete
  	 @key = Keyword.find("#{params[:id]}")
    @key.destroy
    render json: Keyword.all.to_json