app/controllers/users_controller.rb

  def get_user
  	render json: User.all.to_json
---
SELECT "users".* FROM "users"

  def add_user
  	@user = User.new({:user => "#{params[:user].strip}"})
    @user.save!
    render json: User.all.to_json
---
INSERT INTO "users" ("user", "created_at", "updated_at") VALUES (?, ?, ?)  [["user", "fgfgff"], ["created_at", "2015-08-03 11:01:18.333770"], ["updated_at", "2015-08-03 11:01:18.333770"]]
SELECT "users".* FROM "users"

  def delete_user
  	@user = User.find("#{params[:id]}")
    @user.destroy
    render json: User.all.to_json
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
SELECT "users".* FROM "users"